In [14]:
import pandas as pd

# Series

In [15]:
data = [1, 2, 3, 4, 5]

In [16]:
s = pd.Series(data)

In [17]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [20]:
index = ['Linha ' + str(i) for i in range(5)]

In [21]:
index

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

In [22]:
s = pd.Series(data = data, index = index)

In [23]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [24]:
data = {'Linha ' + str(i): i + 1 for i in range(5)}

In [25]:
data

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [26]:
s = pd.Series(data)

In [27]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [28]:
s1 = s + 2

In [29]:
s1

Linha 0    3
Linha 1    4
Linha 2    5
Linha 3    6
Linha 4    7
dtype: int64

In [30]:
s2 = s + s1
s2

Linha 0     4
Linha 1     6
Linha 2     8
Linha 3    10
Linha 4    12
dtype: int64

# DataFrame

In [31]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

In [32]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [33]:
df1 = pd.DataFrame(data)

In [34]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [35]:
index = ['Linha ' + str(i) for i in range(3)]

In [36]:
index

['Linha 0', 'Linha 1', 'Linha 2']

In [37]:
df1 = pd.DataFrame(data, index = index)

In [38]:
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [39]:
columns = ['Coluna ' + str(i) for i in range(3)]
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [40]:
df1 = pd.DataFrame(data, index = index, columns = columns)
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [52]:
data = {'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
        'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
        'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [53]:
df2 = pd.DataFrame(data)

In [54]:
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [44]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [45]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [46]:
df3 = pd.DataFrame(data, index = index, columns = columns)
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [47]:
df1[df1 > 0] = 'A'
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [55]:
df2[df2 > 0] = 'B'
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [49]:
df3[df3 > 0] = 'C'
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [56]:
df4 = pd.concat([df1, df2, df3])
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [57]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C

In [58]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})

In [59]:
df1

   A  B
X  1  2

In [60]:
df2

   C  D
X  3  4

In [63]:
pd.concat([df1, df2], axis = 0)

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [65]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados)
df

   0  1
0  A  B
1  C  D

In [66]:
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [67]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
index

['X', 'Y']

In [68]:
columns = list('CBA')[::-1]
columns

['A', 'B', 'C']

In [69]:
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [70]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4